Tekla Open API Reference for Tekla Structures 2025
RebarSplitter.SplitTypeEnum Enumeration
 The split type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SplitTypeEnum
Public Enumeration SplitTypeEnum
Members
Member name | Value | Description
LAPPING | 0 |  Lapping.
CRANKING | 1 |  Cranking.
See Also
Reference
Tekla.Structures.Model Namespace